---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ModuleSettings Properties
ModuleSettings Class See Also Send Feedback
---

The ModuleSettings type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Description | The module description. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroLanguageType | The Macro language type. |
|  | Name | The module name. |

# See Also

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace